---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.#ctor(Autodesk.Revit.DB.IFC.IFCData)
source: html/82f96572-6f19-95df-38c2-736e4bbafd5a.htm
---
# Autodesk.Revit.DB.IFC.IFCData.#ctor Method

Creates a copy object.

## Syntax (C#)
```csharp
public IFCData(
	IFCData from
)
```

## Parameters
- **from** (`Autodesk.Revit.DB.IFC.IFCData`) - The IFCData object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null